Rails/GoalApp/app/controllers/goals_controller.rb

  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    if @goal.save
---
INSERT INTO "goals" ("user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["description", "eat a cake"], ["created_at", "2022-02-03 05:17:42.327235"], ["updated_at", "2022-02-03 05:17:42.327235"]]
INSERT INTO "users" ("email", "password_hash", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"